//===========================================================
//
//ポリゴンを出すやつ[bg.cpp]
//Author 大原怜将
//
//===========================================================
#include "main.h"
#include "bg.h"
#include "renderer.h"
#include "object.h"
#include "manager.h"

//================================================================
//静的メンバ変数宣言
//================================================================
LPDIRECT3DTEXTURE9 CBg::m_pTexture = NULL;

//================================================================
//コンストラクタ
//================================================================
CBg::CBg()
{
	
}

//================================================================
//デストラクタ
//================================================================
CBg::~CBg()
{

}

//================================================================
//生成処理
//================================================================
CBg *CBg::Create(void)
{
	//オブジェクト2Dのポインタ
	CBg *pBg = NULL;

	if (pBg == NULL)
	{
		//オブジェクト2Dの生成
		pBg = new CBg;

		pBg->BindTexture(m_pTexture);

		//初期化処理
		pBg->Init();
	}

	return pBg;
}

//================================================================
//ポリゴンの初期化処理
//================================================================
HRESULT CBg::Init(void)
{
	//SetType(TYPE_BG);

	CObject2D::Init();

	return S_OK;
}

//================================================================
//ポリゴンの終了処理
//================================================================
void CBg::Uninit(void)
{
	CObject2D::Uninit();
}

//================================================================
//ポリゴンの更新処理
//================================================================
void CBg::Update(void)
{
	CObject2D::Update();
}

//================================================================
//ポリゴンの描画処理
//================================================================
void CBg::Draw(void)
{
	CObject2D::Draw();
}

//================================================================
//テクスチャの生成(読み込み)
//================================================================
HRESULT CBg::Load(void)
{
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\inoti.jpg",
		&m_pTexture
	);

	return S_OK;
}

//================================================================
//テクスチャの破棄
//================================================================
void CBg::UnLoad(void)
{
	//テクスチャの処理
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}