//===========================================================
//
// ポリゴンを出すやつ[explosion.cpp]
// Author 大原怜将
//
//===========================================================
#include "main.h"
#include "player.h"
#include "renderer.h"
#include "manager.h"
#include "input.h"
#include "sound.h"
#include "bullet.h"
#include "explosion.h"

//================================================================
//静的メンバ変数宣言
//================================================================
LPDIRECT3DTEXTURE9 CExplosion::m_pTexture = NULL;

//================================================================
//コンストラクタ
//================================================================
CExplosion::CExplosion()
{
	m_nLife = 0;       //寿命
	m_move = { 0.0f, 0.0f, 0.0f };  //移動量
}

//================================================================
//コンストラクタ(オーバーロード)
//================================================================
CExplosion::CExplosion(D3DXVECTOR3 pos)
{
	SetPos(&pos);  //位置設定
	m_nLife = 0;       //寿命
	m_move = { 0.0f, 0.0f, 0.0f };  //移動量
}

//================================================================
//デストラクタ
//================================================================
CExplosion::~CExplosion()
{

}

//================================================================
//生成処理
//================================================================
CExplosion *CExplosion::Create(D3DXVECTOR3 pos)
{
	//オブジェクト2Dのポインタ
	CExplosion *pExplosion = NULL;

	if (pExplosion == NULL)
	{
		//オブジェクト2Dの生成
		pExplosion = new CExplosion(pos);

		//テクスチャをバインド
		pExplosion->BindTexture(m_pTexture);

		//初期化処理
		pExplosion->Init();
	}

	return pExplosion;
}

//================================================================
//爆発の初期化処理
//================================================================
HRESULT CExplosion::Init(void)
{
	//初期化処理
	CObject2D::Init();

	//種類の設定
	SetType(TYPE_EXPLOSION);

	//爆発の寿命
	m_nLife = EXPLOSIONLIFE;

	return S_OK;
}

//================================================================
//爆発の終了処理
//================================================================
void CExplosion::Uninit(void)
{
	//終了処理
	CObject2D::Uninit();
}

//================================================================
//爆発の更新処理
//================================================================
void CExplosion::Update(void)
{
	//更新処理
	CObject2D::Update();

	//寿命を減らす
	m_nLife--;

	if (m_nLife < 0)
	{//寿命がないなったら

	    //終了処理
		Uninit();
	}
}

//================================================================
//爆発の描画処理
//================================================================
void CExplosion::Draw(void)
{
	//描画処理
	CObject2D::Draw();
}

//================================================================
//テクスチャの生成(読み込み)
//================================================================
HRESULT CExplosion::Load(void)
{
	CRenderer *pRenderer;
	pRenderer = CManager::GetRenderer();

	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\explosion000.png",
		&m_pTexture
	);

	return S_OK;
}

//================================================================
//テクスチャの破棄
//================================================================
void CExplosion::UnLoad(void)
{
	//テクスチャの処理
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}